-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 13, 2017 at 03:36 PM
-- Server version: 5.7.15-log
-- PHP Version: 7.0.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `openhouse`
--

-- --------------------------------------------------------

--
-- Table structure for table `score`
--

CREATE TABLE `score` (
  `id` int(11) NOT NULL,
  `num` int(3) NOT NULL,
  `school` varchar(255) NOT NULL,
  `score` int(3) NOT NULL,
  `coin` varchar(100) NOT NULL,
  `flag` varchar(100) NOT NULL,
  `type` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `score`
--

INSERT INTO `score` (`id`, `num`, `school`, `score`, `coin`, `flag`, `type`) VALUES
(1, 1, 'การแข่งขันอ่าน-เขียนคำ ประถมตอนปลาย ประเภทเดี่ยว', 20, 'ทอง', 'ชนะ', '1praone'),
(2, 1, 'การแข่งขันอ่าน-เขียนคำ มัธยมตอนต้น ประเภทเดี่ยว', 20, 'ทอง', 'ชนะเลิศ', '1tonone'),
(3, 1, 'การแข่งขันคัดลายมือ ประถมตอนปลาย ประเภทเดี่ยว ', 20, 'ทอง', 'ชนะเลิศ', '2praone'),
(4, 1, 'การแข่งขันคัดลายมือ มัธยมตอนต้น ประเภทเดี่ยว', 20, 'ทอง', 'ชนะเลิศ', '2tonone'),
(5, 1, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ประถมตอนปลาย ประเภทเดี่ยว ', 20, 'ทอง', 'ชนะเลิศ', '3praone'),
(6, 1, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ มัธยมตอนต้น ประเภทเดี่ยว ', 20, 'ทอง', 'ชนะเลิศ', '3tonone'),
(7, 1, 'การแข่งขันคิดเลขเร็ว ประถมตอนปลาย ประเภทเดี่ยว ', 20, 'ทอง', 'ชนะเลิศ', '4praone'),
(8, 1, 'การแข่งขันคิดเลขเร็ว มัธยมตอนต้น ประเภทเดี่ยว ', 20, 'ทอง', 'ชนะเลิศ', '4tonone'),
(9, 1, 'การแข่งขันอัจฉริยภาพทางวิทยาศาสตร์ ประถมตอนปลาย ประเภท ทีม 3 คน ', 10, 'ทอง', 'ชนะเลิศ', '5prateam'),
(10, 1, 'การแข่งขันอัจฉริยภาพทางวิทยาศาสตร์ มัธยมตอนต้น ประเภท ทีม 3 คน ', 20, 'ทอง', 'ชนะเลิศ', '5tonteam'),
(11, 1, 'การประกวดโครงงานวิทยาศาสตร์  ประเภททดลอง ประถมตอนปลาย ประเภท ทีม 3 คน ', 20, 'ทอง', 'ชนะเลิศ', '6prateam'),
(12, 1, 'การประกวดโครงงานวิทยาศาสตร์  ประเภททดลอง มัธยมตอนต้น ประเภท ทีม 3 คน', 10, 'ทอง', 'ชนะเลิศ', '6tonteam'),
(13, 1, 'การประกวดโครงงานวิทยาศาสตร์   ประเภทสิ่งประดิษฐ์ ประถมตอนปลาย ประเภท ทีม 3 คน ', 20, 'ทอง', 'ชนะเลิศ', '7prateam'),
(14, 1, 'การประกวดโครงงานวิทยาศาสตร์   ประเภทสิ่งประดิษฐ์ มัธยมตอนต้น ประเภท ทีม 3 คน ', 20, 'ทอง', 'ชนะเลิศ', '7tonteam'),
(15, 1, 'การแข่งขัน“สวดมนต์หมู่ทำนองสรภัญญะ” ประถมตอนปลาย ประเภททีม 5 คน', 20, 'ทอง', 'ชนะเลิศ', '8prateam'),
(16, 1, 'การแข่งขัน“สวดมนต์หมู่ทำนองสรภัญญะ” มัธยมตอนต้น ประเภททีม 5 คน', 20, 'ทอง', 'ชนะเลิศ', '8tonteam'),
(17, 1, 'การแข่งขัน“เกมอัจฉริยะสังคมศึกษา” ประถมตอนปลาย ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '9prateam'),
(18, 1, 'การแข่งขัน“เกมอัจฉริยะสังคมศึกษา” มัธยมต้อนต้น ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '9tonteam'),
(19, 1, 'การแข่งขันทักษะกีฬาวอลเลย์บอล ประถมศึกษาตอนปลาย ทีมหญิง 2 คน', 20, 'ทอง', 'ชนะเลิศ', '10prateam'),
(20, 1, 'การแข่งขันฟุตบอล ประถมศึกษาตอนปลาย ทีม 11 คน', 20, 'ทอง', 'ชนะเลิศ', '11prateam'),
(21, 1, 'การแข่งขันเซปัคตะกร้อ ประถมศึกษาตอนปลาย ทีมเดี่ยว', 20, 'ทอง', 'ชนะเลิศ', '12prateam'),
(22, 1, 'การแข่งขันประกวด “ร้องเพลงไทยลูกทุ่ง”  ประถมศึกษาตอนปลาย ประเภทเดี่ยว', 20, 'ทอง', 'ชนะเลิศ', '13praone'),
(23, 1, 'การแข่งขันประกวด “ร้องเพลงไทยลูกทุ่ง”  มัธยมศึกษาตอนต้น ประเภทเดี่ยว', 20, 'ทอง', 'ชนะเลิศ', '13tonone'),
(24, 1, 'การแข่งขันกิจกรรมSpelling Bees (การแข่งขันสะกดคำภาษาอังกฤษ) ประถมตอนปลาย ประเภททีม 2 คน', 10, 'ทอง', 'ชนะเลิศ', '14prateam'),
(25, 1, 'การแข่งขันกิจกรรม Spelling Bees (การแข่งขันสะกดคำภาษาอังกฤษ) มัธยมต้น ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '14tonteam'),
(26, 1, 'การแข่งขันกิจกรรมQuiz (การแข่งขันตอบคำถามภาษาอังกฤษ) ประถมตอนปลาย ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '15prateam'),
(27, 1, 'การแข่งขันกิจกรรม Quiz (การแข่งขันตอบคำถามภาษาอังกฤษ) มัธยมตอนต้น ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '1tonteam'),
(28, 1, 'การแข่งขันกิจกรรม Quiz (การแข่งขันตอบคำถามภาษาอังกฤษ) มัธยมตอนต้น ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '15tonteam'),
(29, 1, 'การแข่งขันกิจกรรม Quiz (การแข่งขันตอบคำถามภาษาอังกฤษ) มัธยมตอนต้น ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '15tonteam'),
(30, 1, 'การแข่งขัน“ขับร้องเพลงภาษาจีน” ประถมตอนปลาย ประเภทเดี่ยว', 20, 'ทอง', 'ชนะเลิศ', '16praone'),
(31, 1, 'การแข่งขัน“ขับร้องเพลงภาษาจีน” มัธยมตอนต้น ประเภทเดี่ยว', 20, 'ทอง', '10', '16tonone'),
(32, 1, 'การแข่งขัน“ขับร้องเพลงภาษาจีน” มัธยมตอนต้น ประเภทเดี่ยว', 20, 'ทอง', '10', '16tonone'),
(33, 1, 'การแข่งขันสร้างหนังสืออิเล็กทรอนิกส์(E - book) ประถมศึกษาตอนปลาย ประเภททีม  2 คน', 20, 'ทอง', 'ชนะเลิศ', '17prateam'),
(34, 1, 'การแข่งขันสร้าง Webpage ประเภท “Web Editor” มัธยมศึกษาตอนต้น ประเภททีม 2 คน', 20, 'ทอง', 'ชนะเลิศ', '18tonteam'),
(35, 1, 'awasdwa', 30, 'awsdasdwe', 'asffeas', 'การแข่งขันอ่าน-เขียนคำประถมปลายเดี่ยว'),
(36, 1, 'awasdwa', 30, 'awsdasdwe', 'asffeas', 'การแข่งขันอ่าน-เขียนคำประถมปลายเดี่ยว'),
(37, 2, 'awsfff', 100, 'm', 'l', '1praone');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `score`
--
ALTER TABLE `score`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `score`
--
ALTER TABLE `score`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
